Управление_состоянием/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Стороны</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бюджетирование</name>
    <attributes>
      <name>ОбъектИнвестирования</name>
      <type>
        <types>CatalogRef.ОбъектыИнвестирования</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_состоянием/src/Catalogs/ДоговорыКонтрагентов/ManagerModule.bsl
Функция ПолучитьТекстЗапроса(ПараметрыЗапроса = Неопределено, Параметры, Поля = "", ТекстЗапроса = Неопределено) Экспорт
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = Новый Структура;
	КонецЕсли;
	СхемаЗапроса 		= РаботаСДаннымиВыбора.ПолучитьСхемуЗапросаПоИсточнику("Справочник.ДоговорыКонтрагентов",, Поля, ТекстЗапроса);
	ЗапросИсточника		= СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество()-1];
	ОператорИсточника	= ЗапросИсточника.Операторы[0];
	Источник			= ОператорИсточника.Источники.НайтиПоПсевдониму("Источник");
	Если Параметры.Свойство("Отбор") Тогда
		ОбщийКлиентСервер.ПереместитьЗначенияСвойств(Параметры.Отбор, ПараметрыЗапроса, "Организация,Контрагент");
		Если ОбщийКлиентСервер.СтруктураСодержитСвойства(ПараметрыЗапроса, "Организация,Контрагент") Тогда
			РаботаСоСхемойЗапроса.Источник(ОператорИсточника, "Справочник.ДоговорыКонтрагентов.Стороны", "ТЧСтороны");
			РаботаСоСхемойЗапроса.Соединение(ОператорИсточника, Источник, "ТЧСтороны", "Источник.Ссылка = ТЧСтороны.Ссылка", ТипСоединенияСхемыЗапроса.Внутреннее);
			ОператорИсточника.Отбор.Добавить("ТЧСтороны.Организация = &Организация");
			ОператорИсточника.Отбор.Добавить("ТЧСтороны.Контрагент = &Контрагент");
		Иначе
			ОбщийКлиентСервер.УдалитьСвойстваСтруктуры(ПараметрыЗапроса, "Организация,Контрагент");
		КонецЕсли;
	КонецЕсли;//  Отбор
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РаботаСДаннымиВыбора.ЗаполнитьДанныеВыбора(ОбщегоНазначения.ИмяТаблицыПоСсылке(ПустаяСсылка()), ДанныеВыбора, Параметры);
КонецПроцедуры
